02-Control Structures and Debugging/slides.org
#+OPTIONS: reveal_center:t reveal_control:t reveal_height:-1
#+OPTIONS: reveal_history:nil reveal_keyboard:t reveal_mathjax:nil
#+OPTIONS: reveal_overview:t reveal_progress:t
#+OPTIONS: reveal_rolling_links:nil reveal_slide_number:t
#+OPTIONS: reveal_title_slide:t reveal_width:-1
#+options: toc:nil num:nil
#+REVEAL_MARGIN: -1
#+REVEAL_MIN_SCALE: -1
#+REVEAL_MAX_SCALE: -1
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_TRANS: default
#+REVEAL_SPEED: default
#+REVEAL_THEME: black
#+REVEAL_EXTRA_CSS: ../code_formatting.css
#+REVEAL_EXTRA_JS: 
#+REVEAL_HLEVEL: 1
#+REVEAL_TITLE_SLIDE_TEMPLATE: <h1>%t</h1> <h2>%a</h2> <h2>%e</h2> <h2>%d</h2>
#+REVEAL_TITLE_SLIDE_BACKGROUND:
#+REVEAL_TITLE_SLIDE_BACKGROUND_SIZE:
#+REVEAL_TITLE_SLIDE_BACKGROUND_REPEAT:
#+REVEAL_TITLE_SLIDE_BACKGROUND_TRANSITION:
#+REVEAL_MATHJAX_URL: http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML
#+REVEAL_PREAMBLE:
#+REVEAL_HEAD_PREAMBLE:
#+REVEAL_POSTAMBLE:
#+REVEAL_MULTIPLEX_ID:
#+REVEAL_MULTIPLEX_SECRET:
#+REVEAL_MULTIPLEX_URL:
#+REVEAL_MULTIPLEX_SOCKETIO_URL:
#+REVEAL_PLUGINS:

#+AUTHOR: 
#+email: 
#+Title: Control Structures and Functions

* General Business
# A few general questions to gauge the process of the students and if we need to help/adapt
# Ask Students if they have found a text editor and which ones.
- Has everybody found a text editor that they like?
# Ask them if they were able to install the Anaconda Python Distribution.
- Has everybody installed [[https://www.continuum.io/downloads][Anaconda]]?
# They can install it on the EDV Lab PC's into their user folder
- Can everybody open the Anaconda Command prompt?
- Who knows the basics of command prompt usage (changing director, listing
  directory contents)?

* Comparison and Control Structures
** Boolean Expressions
- Compare two objects and return ~True~ or ~False~
#+begin_src python :results output pp :exports both :tangle basic_example.py
print(3 < 5) # less than
print(3 > 3) # greater than
print(type("text") == str) # equal
print("text" != 2) # not equal
#+end_src

#+RESULTS:
: True
: False
: True
: True

** if condition
- Checks if a boolean expression is True or False
- Executes code conditionally (only if the condition is satisfied)
#+begin_src python :results output pp :exports both :tangle lecture2.py
if 3 < 5:
    print("Three is less than 5")

if 5 <= 3:
    print("Five is less or equal to three")
#+end_src

#+RESULTS:
: Three is less than 5

** if elif else
- ~if~ alone is often not enough
- ~elif~ is short for ~else if~ and is checked if original if statement is not satisfied
- code under ~else~ is executed when if statement is not satisfied
#+begin_src python :results output pp :exports both
x = 1
if x > 1:
    print("Greater than one")
elif x < 1:
    print("Less than one")
else:
    print("Exactly one")
#+end_src

#+RESULTS:
: Exactly one

** The ~in~ operator
Checks if an element is inside a list or dictionary
#+begin_src python :results output pp :exports both :tangle lecture2.py
name = "Rick"
if name in ["Rick", "Morty"]:
    print("Name is in list")
#+end_src

#+RESULTS:
: Name is in list

#+begin_src python :results output pp :exports both :tangle lecture2.py
key = 1
if key in {1: "one", 2: "two"}:
    print("key is in dict")

if key in {"one": 1, "two": 2}:
    print("Comparison of dicts is against keys by default")

if key in {"one": 1, "two": 2}.values():
    print("value is in dict")
#+end_src

#+RESULTS:
: key is in dict
: value is in dict
** The ~is~ operator
- The ~is~ operator checks the instance and not the values
#+begin_src python :results output pp :exports both
var = None
one = 1
ls = [1, 2, 3]
print(var is None, var == None)
print(one is 1, one == 1)
print(ls is [1, 2, 3], ls == [1, 2, 3])
#+end_src

#+RESULTS:
: True True
: True True
: False True

** The ~not~ operator
- the ~not~ operator inverts a boolean expression
#+begin_src python :results output pp :exports both
print(not False)
print(not 3 < 5)
#+end_src

#+RESULTS:
: True
: False

