02-Control Structures and Functions/slides.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Control Structures and Functions</title>

<link rel="stylesheet" href="../reveal.js/css/reveal.css"/>
<link rel="stylesheet" href="../reveal.js/css/theme/black.css" id="theme"/>
<link rel="stylesheet" href="../code_formatting.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="" data-background-size="" data-background-repeat="" data-background-transition="">
<h1>Control Structures and Functions</h1> <h2></h2> <h2><a href="mailto:"></a></h2> <h2></h2>
</section>

<section>
<section id="slide-orgheadline1">
<h2 id="orgheadline1">General Business</h2>
<ul>
<li>Has everybody found a text editor that they like?</li>
<li>Has everybody installed <a href="https://www.continuum.io/downloads">Anaconda</a>?</li>
<li>Can everybody open the Anaconda Command prompt?</li>
<li>Who knows the basics of command prompt usage (changing director, listing
directory contents)?</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgheadline10">
<h2 id="orgheadline10">Comparison and Control Structures</h2>
<div class="outline-text-2" id="text-orgheadline10">
</div></section>
<section id="slide-orgheadline2">
<h3 id="orgheadline2">Boolean Expressions</h3>
<ul>
<li>Compare two objects and return <code>True</code> or <code>False</code></li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">3</span> &lt; <span style="color: #689f38;">5</span><span style="color: #e91e63;">)</span> <span style="color: #607d8b;"># </span><span style="color: #607d8b;">less than</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">3</span> &gt; <span style="color: #689f38;">3</span><span style="color: #e91e63;">)</span> <span style="color: #607d8b;"># </span><span style="color: #607d8b;">greater than</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #B71C1C;">type</span><span style="color: #1565C0;">(</span><span style="color: #689f38;">"text"</span><span style="color: #1565C0;">)</span> == <span style="color: #B71C1C;">str</span><span style="color: #e91e63;">)</span> <span style="color: #607d8b;"># </span><span style="color: #607d8b;">equal</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"text"</span> != <span style="color: #689f38;">2</span><span style="color: #e91e63;">)</span> <span style="color: #607d8b;"># </span><span style="color: #607d8b;">not equal</span>
</pre>
</div>

<pre class="example">
True
False
True
True
</pre>

</section>
<section id="slide-orgheadline3">
<h3 id="orgheadline3">if condition</h3>
<ul>
<li>Checks if a boolean expression is True or False</li>
<li>Executes code conditionally (only if the condition is satisfied)</li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">if</span> <span style="color: #689f38;">3</span> &lt; <span style="color: #689f38;">5</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Three is less than 5"</span><span style="color: #e91e63;">)</span>

<span style="color: #00796b;">if</span> <span style="color: #689f38;">5</span> &lt;= <span style="color: #689f38;">3</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Five is less or equal to three"</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
Three is less than 5
</pre>

</section>
<section id="slide-orgheadline4">
<h3 id="orgheadline4">if elif else</h3>
<ul>
<li><code>if</code> alone is often not enough</li>
<li><code>elif</code> is short for <code>else if</code> and is checked if original if statement is not satisfied</li>
<li>code under <code>else</code> is executed when if statement is not satisfied</li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">x</span> = <span style="color: #689f38;">1</span>
<span style="color: #00796b;">if</span> x &gt; <span style="color: #689f38;">1</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Greater than one"</span><span style="color: #e91e63;">)</span>
<span style="color: #00796b;">elif</span> x &lt; <span style="color: #689f38;">1</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Less than one"</span><span style="color: #e91e63;">)</span>
<span style="color: #00796b;">else</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Exactly one"</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
Exactly one
</pre>

</section>
<section id="slide-orgheadline5">
<h3 id="orgheadline5">The <code>in</code> operator</h3>
<p>
Checks if an element is inside a list or dictionary
</p>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">name</span> = <span style="color: #689f38;">"Rick"</span>
<span style="color: #00796b;">if</span> name <span style="color: #00796b;">in</span> <span style="color: #e91e63;">[</span><span style="color: #689f38;">"Rick"</span>, <span style="color: #689f38;">"Morty"</span><span style="color: #e91e63;">]</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Name is in list"</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
Name is in list
</pre>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">key</span> = <span style="color: #689f38;">1</span>
<span style="color: #00796b;">if</span> key <span style="color: #00796b;">in</span> <span style="color: #e91e63;">{</span><span style="color: #689f38;">1</span>: <span style="color: #689f38;">"one"</span>, <span style="color: #689f38;">2</span>: <span style="color: #689f38;">"two"</span><span style="color: #e91e63;">}</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"key is in dict"</span><span style="color: #e91e63;">)</span>

<span style="color: #00796b;">if</span> key <span style="color: #00796b;">in</span> <span style="color: #e91e63;">{</span><span style="color: #689f38;">"one"</span>: <span style="color: #689f38;">1</span>, <span style="color: #689f38;">"two"</span>: <span style="color: #689f38;">2</span><span style="color: #e91e63;">}</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Comparison of dicts is against keys by default"</span><span style="color: #e91e63;">)</span>

<span style="color: #00796b;">if</span> key <span style="color: #00796b;">in</span> <span style="color: #e91e63;">{</span><span style="color: #689f38;">"one"</span>: <span style="color: #689f38;">1</span>, <span style="color: #689f38;">"two"</span>: <span style="color: #689f38;">2</span><span style="color: #e91e63;">}</span>.values<span style="color: #e91e63;">()</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"value is in dict"</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
key is in dict
value is in dict
</pre>
</section>
<section id="slide-orgheadline6">
<h3 id="orgheadline6">The <code>is</code> operator</h3>
<ul>
<li>The <code>is</code> operator checks the instance and not the values</li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">var</span> = <span style="color: #558b2f;">None</span>
<span style="color: #EF6C00;">one</span> = <span style="color: #689f38;">1</span>
<span style="color: #EF6C00;">ls</span> = <span style="color: #e91e63;">[</span><span style="color: #689f38;">1</span>, <span style="color: #689f38;">2</span>, <span style="color: #689f38;">3</span><span style="color: #e91e63;">]</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>var <span style="color: #00796b;">is</span> <span style="color: #558b2f;">None</span>, var == <span style="color: #558b2f;">None</span><span style="color: #e91e63;">)</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>one <span style="color: #00796b;">is</span> <span style="color: #689f38;">1</span>, one == <span style="color: #689f38;">1</span><span style="color: #e91e63;">)</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>ls <span style="color: #00796b;">is</span> <span style="color: #1565C0;">[</span><span style="color: #689f38;">1</span>, <span style="color: #689f38;">2</span>, <span style="color: #689f38;">3</span><span style="color: #1565C0;">]</span>, ls == <span style="color: #1565C0;">[</span><span style="color: #689f38;">1</span>, <span style="color: #689f38;">2</span>, <span style="color: #689f38;">3</span><span style="color: #1565C0;">]</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
True True
True True
False True
</pre>

</section>
<section id="slide-orgheadline7">
<h3 id="orgheadline7">The <code>not</code> operator</h3>
<ul>
<li>the <code>not</code> operator inverts a boolean expression</li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #00796b;">not</span> <span style="color: #558b2f;">False</span><span style="color: #e91e63;">)</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #00796b;">not</span> <span style="color: #689f38;">3</span> &lt; <span style="color: #689f38;">5</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
True
False
</pre>

</section>
