02-Control Structures and Debugging/slides.org
** Boolean operators
The ~and~ and ~or~ operators can be used to combine multiple expressions
#+begin_src python :results output pp :exports both :tangle lecture2.py
var = "test"
if 5 > 3 and var == "test":
    print("both statements are true")
#+end_src

#+RESULTS:
: both statements are true

#+begin_src python :results output pp :exports both :tangle lecture2.py
if 5 > 3 or 8 > 2:
    print("at least one statement is true")
#+end_src

#+RESULTS:
: at least one statement is true

** ~pass~ and ~assert~
- pass does nothing
- assert checks something and throws an Exception if not ~True~
#+begin_src python :tangle lecture4.py :tangle lecture2.py
  name = 2
  assert type(name) == str, "name should be a string"
  if type(name) != str:
      pass # can be useful when planning program structure
#+end_src

#+begin_example
Traceback (most recent call last):
  File "<stdin>", line 2, in <module>
AssertionError: name should be a string
#+end_example

* Loops
- A loop executes the same code a certain number of times.
- A loop can also execute the same code for each element in e.g. a list.
** Basic loop

#+begin_src python :results output pp :exports both :tangle lecture2.py
i = 0
data = [8, 4.5]

# the len function gets the length of a list
print("Length of the list is:", len(data)) 

while i < len(data):
    print(data[i])
    i += 1
#+end_src

#+RESULTS:
: Length of the list is: 2
: 8
: 4.5


** 
Python can loop/iterate directly over the list elements
#+begin_src python :results output pp :exports both :tangle lecture2.py
data = [ 1.73, 2.4122, 80, -4 ]

# iterate over elements, using keyword 'in'
for elem in data:
    print(elem)
#+end_src

#+RESULTS:
: 1.73
: 2.4122
: 80
: -4

** iterate over multiple lists
#+begin_src python :results output pp :exports both :tangle lecture2.py
data = [ 1.73, 2.4122, 80, -4 ]
datanames = ["number 1", "number 2", "number 3", "number 4"]
for number, name in zip(data, datanames):
    print(name, number)
#+end_src

** iterate over dictionaries
#+begin_src python :results output pp :exports both :tangle lecture2.py
d = {"key1": 1, "key2": 2, "key3": 3}
for key in d:
    print(key)
#+end_src

#+RESULTS:
: ('key3', 3)
: ('key2', 2)
: ('key1', 1)

#+begin_src python :results output pp :exports both :tangle lecture2.py
d = {"key1": 1, "key2": 2, "key3": 3}
for key, item in d.iteritems():
    print(key, item)
#+end_src

#+RESULTS:
: ('key3', 3)
: ('key2', 2)
: ('key1', 1)

** sometimes you need an indices
range can be addressed with (start, stop, step)
#+begin_src python :results output pp :exports both :tangle lecture2.py
  print("range")
  for i in range(1, 10, 2):
      print(i)
#+end_src

#+RESULTS:
: range
: 1
: 3
: 5
: 7
: 9

** sometimes enumerate is also handy
#+begin_src python :results output pp :exports both :tangle lecture2.py
l = ["a", "b", "c", "d"]
for i, item in enumerate(l):
    print(i, item)
#+end_src

#+RESULTS:
: 0 a
: 1 b
: 2 c
: 3 d

** if/else block
#+begin_src python :results output pp :exports both :tangle lecture2.py
dataset1 = [ 1.73, 2.4122, 80, -4 ]
# if/else blocks
for d in dataset1:
    if d > 3:
        res = ">3"
    else:
        res = "<=3"
    print(res)
#+end_src

#+RESULTS:
: <=3
: <=3
: >3
: <=3

