02-Control Structures and Functions/slides.html
<section id="slide-orgheadline8">
<h3 id="orgheadline8">Boolean operators</h3>
<p>
The <code>and</code> and <code>or</code> operators can be used to combine multiple expressions
</p>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">var</span> = <span style="color: #689f38;">"test"</span>
<span style="color: #00796b;">if</span> <span style="color: #689f38;">5</span> &gt; <span style="color: #689f38;">3</span> <span style="color: #00796b;">and</span> var == <span style="color: #689f38;">"test"</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"both statements are true"</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
both statements are true
</pre>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">if</span> <span style="color: #689f38;">5</span> &gt; <span style="color: #689f38;">3</span> <span style="color: #00796b;">or</span> <span style="color: #689f38;">8</span> &gt; <span style="color: #689f38;">2</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"at least one statement is true"</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
at least one statement is true
</pre>

</section>
<section id="slide-orgheadline9">
<h3 id="orgheadline9"><code>pass</code> and <code>assert</code></h3>
<ul>
<li>pass does nothing</li>
<li>assert checks something and throws an Exception if not <code>True</code></li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">name</span> = <span style="color: #689f38;">2</span>
<span style="color: #00796b;">assert</span> <span style="color: #B71C1C;">type</span><span style="color: #e91e63;">(</span>name<span style="color: #e91e63;">)</span> == <span style="color: #B71C1C;">str</span>, <span style="color: #689f38;">"name should be a string"</span>
<span style="color: #00796b;">if</span> <span style="color: #B71C1C;">type</span><span style="color: #e91e63;">(</span>name<span style="color: #e91e63;">)</span> != <span style="color: #B71C1C;">str</span>:
    <span style="color: #00796b;">pass</span> <span style="color: #607d8b;"># </span><span style="color: #607d8b;">can be useful when planning program structure</span>
</pre>
</div>

<pre class="example">
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 2, in &lt;module&gt;
AssertionError: name should be a string
</pre>

</section>
</section>
<section>
<section id="slide-orgheadline21">
<h2 id="orgheadline21">Loops</h2>
<ul>
<li>A loop executes the same code a certain number of times.</li>
<li>A loop can also execute the same code for each element in e.g. a list.</li>

</ul>
</section>
<section id="slide-orgheadline11">
<h3 id="orgheadline11">Basic loop</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">i</span> = <span style="color: #689f38;">0</span>
<span style="color: #EF6C00;">data</span> = <span style="color: #e91e63;">[</span><span style="color: #689f38;">8</span>, <span style="color: #689f38;">4</span>.<span style="color: #689f38;">5</span><span style="color: #e91e63;">]</span>

<span style="color: #607d8b;"># </span><span style="color: #607d8b;">the len function gets the length of a list</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Length of the list is:"</span>, <span style="color: #B71C1C;">len</span><span style="color: #1565C0;">(</span>data<span style="color: #1565C0;">)</span><span style="color: #e91e63;">)</span> 

<span style="color: #00796b;">while</span> i &lt; <span style="color: #B71C1C;">len</span><span style="color: #e91e63;">(</span>data<span style="color: #e91e63;">)</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>data<span style="color: #1565C0;">[</span>i<span style="color: #1565C0;">]</span><span style="color: #e91e63;">)</span>
    <span style="color: #EF6C00;">i</span> += <span style="color: #689f38;">1</span>
</pre>
</div>

<pre class="example">
Length of the list is: 2
8
4.5
</pre>


</section>
<section id="slide-orgheadline12">
<h3 id="orgheadline12"></h3>
<p>
Python can loop/iterate directly over the list elements
</p>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">data</span> = <span style="color: #e91e63;">[</span> <span style="color: #689f38;">1</span>.<span style="color: #689f38;">73</span>, <span style="color: #689f38;">2</span>.<span style="color: #689f38;">4122</span>, <span style="color: #689f38;">80</span>, -<span style="color: #689f38;">4</span> <span style="color: #e91e63;">]</span>

<span style="color: #607d8b;"># </span><span style="color: #607d8b;">iterate over elements, using keyword 'in'</span>
<span style="color: #00796b;">for</span> elem <span style="color: #00796b;">in</span> data:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>elem<span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
1.73
2.4122
80
-4
</pre>

</section>
<section id="slide-orgheadline13">
<h3 id="orgheadline13">iterate over multiple lists</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">data</span> = <span style="color: #e91e63;">[</span> <span style="color: #689f38;">1</span>.<span style="color: #689f38;">73</span>, <span style="color: #689f38;">2</span>.<span style="color: #689f38;">4122</span>, <span style="color: #689f38;">80</span>, -<span style="color: #689f38;">4</span> <span style="color: #e91e63;">]</span>
<span style="color: #EF6C00;">datanames</span> = <span style="color: #e91e63;">[</span><span style="color: #689f38;">"number 1"</span>, <span style="color: #689f38;">"number 2"</span>, <span style="color: #689f38;">"number 3"</span>, <span style="color: #689f38;">"number 4"</span><span style="color: #e91e63;">]</span>
<span style="color: #00796b;">for</span> number, name <span style="color: #00796b;">in</span> <span style="color: #B71C1C;">zip</span><span style="color: #e91e63;">(</span>data, datanames<span style="color: #e91e63;">)</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>name, number<span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
number 1 1.73
number 2 2.4122
number 3 80
number 4 -4
</pre>

</section>
<section id="slide-orgheadline14">
<h3 id="orgheadline14">iterate over dictionaries</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">d</span> = <span style="color: #e91e63;">{</span><span style="color: #689f38;">"key1"</span>: <span style="color: #689f38;">1</span>, <span style="color: #689f38;">"key2"</span>: <span style="color: #689f38;">2</span>, <span style="color: #689f38;">"key3"</span>: <span style="color: #689f38;">3</span><span style="color: #e91e63;">}</span>
<span style="color: #00796b;">for</span> key <span style="color: #00796b;">in</span> d:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>key<span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
key2
key1
key3
</pre>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">d</span> = <span style="color: #e91e63;">{</span><span style="color: #689f38;">"key1"</span>: <span style="color: #689f38;">1</span>, <span style="color: #689f38;">"key2"</span>: <span style="color: #689f38;">2</span>, <span style="color: #689f38;">"key3"</span>: <span style="color: #689f38;">3</span><span style="color: #e91e63;">}</span>
<span style="color: #00796b;">for</span> key, item <span style="color: #00796b;">in</span> d.iteritems<span style="color: #e91e63;">()</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>key, item<span style="color: #e91e63;">)</span>
</pre>
</div>

</section>
<section id="slide-orgheadline15">
<h3 id="orgheadline15">sometimes you need an indices</h3>
<p>
range can be addressed with (start, stop, step)
</p>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"range"</span><span style="color: #e91e63;">)</span>
<span style="color: #00796b;">for</span> i <span style="color: #00796b;">in</span> <span style="color: #B71C1C;">range</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">1</span>, <span style="color: #689f38;">10</span>, <span style="color: #689f38;">2</span><span style="color: #e91e63;">)</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>i<span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
range
1
3
5
7
9
</pre>

</section>
<section id="slide-orgheadline16">
<h3 id="orgheadline16">sometimes enumerate is also handy</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">l</span> = <span style="color: #e91e63;">[</span><span style="color: #689f38;">"a"</span>, <span style="color: #689f38;">"b"</span>, <span style="color: #689f38;">"c"</span>, <span style="color: #689f38;">"d"</span><span style="color: #e91e63;">]</span>
<span style="color: #00796b;">for</span> i, item <span style="color: #00796b;">in</span> <span style="color: #B71C1C;">enumerate</span><span style="color: #e91e63;">(</span>l<span style="color: #e91e63;">)</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>i, item<span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
0 a
1 b
2 c
3 d
</pre>

</section>
<section id="slide-orgheadline17">
<h3 id="orgheadline17">if/else block</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">dataset1</span> = <span style="color: #e91e63;">[</span> <span style="color: #689f38;">1</span>.<span style="color: #689f38;">73</span>, <span style="color: #689f38;">2</span>.<span style="color: #689f38;">4122</span>, <span style="color: #689f38;">80</span>, -<span style="color: #689f38;">4</span> <span style="color: #e91e63;">]</span>
<span style="color: #607d8b;"># </span><span style="color: #607d8b;">if/else blocks</span>
<span style="color: #00796b;">for</span> d <span style="color: #00796b;">in</span> dataset1:
    <span style="color: #00796b;">if</span> d &gt; <span style="color: #689f38;">3</span>:
        <span style="color: #EF6C00;">res</span> = <span style="color: #689f38;">"&gt;3"</span>
    <span style="color: #00796b;">else</span>:
        <span style="color: #EF6C00;">res</span> = <span style="color: #689f38;">"&lt;=3"</span>
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>res<span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
&lt;=3
&lt;=3
&gt;3
&lt;=3
</pre>

</section>
