02-Control Structures and Debugging/slides.org
** for loops with break and else
#+begin_src python :results output pp :exports both :tangle lecture4.py
  for n in range(2, 8): # lets debug through this
      for x in range(2, n):
          if n % x == 0:
              print n, 'equals', x, '*', n / x
              break # breaks out of (ends) current loop
      else:
          # loop fell through without finding a factor
          print n, 'is a prime number'
#+end_src

#+RESULTS:
: 2 is a prime number
: 3 is a prime number
: 4 equals 2 * 2
: 5 is a prime number
: 6 equals 2 * 3
: 7 is a prime number

** for loops and continue
#+begin_src python :results output pp :exports both :tangle lecture4.py
  for num in range(2, 8):
      if num % 2 == 0: # percent sign is modulo
          print "Found an even number", num
          continue # continue with the next iteration of the loop
      print "Found a number", num
#+end_src

#+RESULTS:
: Found an even number 2
: Found a number 3
: Found an even number 4
: Found a number 5
: Found an even number 6
: Found a number 7


** Mini Exercise
#+begin_src python :results output pp :exports both :tangle lecture2.py
####################################################################
# Mini Exercise 

# Try to format and print only the positive numbers in 'dataset1',
# with 1 number on each line,
# and with 2 digits after the comma

####################################################################
#+end_src

* Functions
- A function is a block of code that can be reused
- A function can take arguments and keywords
- A function can return a value
- It must be defined before we can use it
#+begin_src python :results output pp :exports both
def function():
    print("print in a function")

function()
#+end_src

#+RESULTS:
: print in a function

** 
#+begin_src python :results output pp :session func1 :exports both :tangle lecture2.py
  def classify(dataset, threshold):
      """
      classifies dataset into small and large class using the threshold

      Parameters
      ----------
      dataset: list
          list to classify
      threshold: float
          threshold to use for classification

      Returns
      -------
      results: list
          containing True or False
      """
      results = []  # create an empty list
      for data in dataset:
          results.append(data > threshold)
      return results
#+end_src


** 
#+begin_src python :results output  pp :session func1 :exports both :tangle lecture2.py
dataset1 = [1.73, 80, 2.4122, -4]
res = classify(dataset1, 2)
print(res)
print(classify(dataset1, 1))
#+end_src

** Documentation
There are several ways to document code in Python. 

Scientists often use the [[https://github.com/numpy/numpy/blob/master/doc/HOWTO_DOCUMENT.rst.txt][numpy Documentation style.]]

There is also [[https://www.python.org/dev/peps/pep-0257/][PEP 257 Python Docstring Standard]]

#+ATTR_REVEAL: :frag grow highlight-red
Be Consistent

** 
Documentation is useful for autocompletion in IDE

Generation of HTML or PDF Documentation using [[http://sphinx-doc.org/][Sphinx]].

** Functions with keyword arguments

#+begin_src python :results output pp :session func1 :exports both :tangle lecture2.py
  def classifydefault(dataset, threshold=2.5):
      """
      classifies dataset into small and large class using the threshold

      Parameters
      ----------
      dataset: list
          list to classify
      threshold: float, optional
          threshold to use for classification

      Returns
      -------
      results: list
          containing True or False
      """
      results = []  # create an empty list
      for data in dataset:
          results.append(data > threshold)
      return results
#+end_src

** 
#+begin_src python :results output  pp :session func1 :exports both :tangle lecture2.py
dataset2 = [1.73, 80, 2.4122, -4, 2.6]
print(classifydefault(dataset2))
#+end_src

