02-Control Structures and Functions/slides.html
<section id="slide-orgheadline18">
<h3 id="orgheadline18">for loops with break and else</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">for</span> n <span style="color: #00796b;">in</span> <span style="color: #B71C1C;">range</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">2</span>, <span style="color: #689f38;">8</span><span style="color: #e91e63;">)</span>: <span style="color: #607d8b;"># </span><span style="color: #607d8b;">lets debug through this</span>
    <span style="color: #00796b;">for</span> x <span style="color: #00796b;">in</span> <span style="color: #B71C1C;">range</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">2</span>, n<span style="color: #e91e63;">)</span>:
        <span style="color: #00796b;">if</span> n % x == <span style="color: #689f38;">0</span>:
            <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>n, <span style="color: #689f38;">'equals'</span>, x, <span style="color: #689f38;">'*'</span>, n / x<span style="color: #e91e63;">)</span>
            <span style="color: #00796b;">break</span> <span style="color: #607d8b;"># </span><span style="color: #607d8b;">breaks out of (ends) current loop</span>
    <span style="color: #00796b;">else</span>:
        <span style="color: #607d8b;"># </span><span style="color: #607d8b;">loop fell through without finding a factor</span>
        <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>n, <span style="color: #689f38;">'is a prime number'</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
2 is a prime number
3 is a prime number
4 equals 2 * 2.0
5 is a prime number
6 equals 2 * 3.0
7 is a prime number
</pre>

</section>
<section id="slide-orgheadline19">
<h3 id="orgheadline19">for loops and continue</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">for</span> num <span style="color: #00796b;">in</span> <span style="color: #B71C1C;">range</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">2</span>, <span style="color: #689f38;">8</span><span style="color: #e91e63;">)</span>:
    <span style="color: #00796b;">if</span> num % <span style="color: #689f38;">2</span> == <span style="color: #689f38;">0</span>: <span style="color: #607d8b;"># </span><span style="color: #607d8b;">percent sign is modulo</span>
        <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Found an even number"</span>, num<span style="color: #e91e63;">)</span>
        <span style="color: #00796b;">continue</span> <span style="color: #607d8b;"># </span><span style="color: #607d8b;">continue with the next iteration of the loop</span>
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"Found a number"</span>, num<span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
Found an even number 2
Found a number 3
Found an even number 4
Found a number 5
Found an even number 6
Found a number 7
</pre>


</section>
<section id="slide-orgheadline20">
<h3 id="orgheadline20">Mini Exercise</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #607d8b;">####################################################################</span>
<span style="color: #607d8b;"># </span><span style="color: #607d8b;">Mini Exercise 1</span>

<span style="color: #607d8b;"># </span><span style="color: #607d8b;">Try to print only the positive numbers in 'dataset1',</span>

<span style="color: #607d8b;">####################################################################</span>
<span style="color: #EF6C00;">dataset1</span> = <span style="color: #e91e63;">[</span> <span style="color: #689f38;">1</span>.<span style="color: #689f38;">73</span>, <span style="color: #689f38;">2</span>.<span style="color: #689f38;">4122</span>, <span style="color: #689f38;">80</span>, -<span style="color: #689f38;">4</span> <span style="color: #e91e63;">]</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgheadline30">
<h2 id="orgheadline30">Functions</h2>
<ul>
<li>A function is a block of code that can be reused</li>
<li>A function can take arguments and keywords</li>
<li>A function can return a value</li>
<li>It must be defined before we can use it</li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">def</span> <span style="color: #0097A7;">function</span><span style="color: #e91e63;">()</span>:
    <span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span><span style="color: #689f38;">"print in a function"</span><span style="color: #e91e63;">)</span>

function<span style="color: #e91e63;">()</span>
</pre>
</div>

<pre class="example">
print in a function
</pre>

</section>
<section id="slide-orgheadline22">
<h3 id="orgheadline22"></h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">def</span> <span style="color: #0097A7;">classify</span><span style="color: #e91e63;">(</span>dataset, threshold<span style="color: #e91e63;">)</span>:
    <span style="color: #689f38;">"""</span>
<span style="color: #689f38;">    classifies dataset into small and large class using the </span>
<span style="color: #689f38;">    threshold</span>

<span style="color: #689f38;">    Parameters</span>
<span style="color: #689f38;">    ----------</span>
<span style="color: #689f38;">    dataset: list</span>
<span style="color: #689f38;">        list to classify</span>
<span style="color: #689f38;">    threshold: float</span>
<span style="color: #689f38;">        threshold to use for classification</span>

<span style="color: #689f38;">    Returns</span>
<span style="color: #689f38;">    -------</span>
<span style="color: #689f38;">    results: list</span>
<span style="color: #689f38;">        containing True or False</span>
<span style="color: #689f38;">    """</span>
    <span style="color: #EF6C00;">results</span> = <span style="color: #e91e63;">[]</span>  <span style="color: #607d8b;"># </span><span style="color: #607d8b;">create an empty list</span>
    <span style="color: #00796b;">for</span> data <span style="color: #00796b;">in</span> dataset:
        results.append<span style="color: #e91e63;">(</span>data &gt; threshold<span style="color: #e91e63;">)</span>
    <span style="color: #00796b;">return</span> results
</pre>
</div>


</section>
<section id="slide-orgheadline23">
<h3 id="orgheadline23"></h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">dataset1</span> = <span style="color: #e91e63;">[</span><span style="color: #689f38;">1</span>.<span style="color: #689f38;">73</span>, <span style="color: #689f38;">80</span>, <span style="color: #689f38;">2</span>.<span style="color: #689f38;">4122</span>, -<span style="color: #689f38;">4</span><span style="color: #e91e63;">]</span>
<span style="color: #EF6C00;">res</span> = classify<span style="color: #e91e63;">(</span>dataset1, <span style="color: #689f38;">2</span><span style="color: #e91e63;">)</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>res<span style="color: #e91e63;">)</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>classify<span style="color: #1565C0;">(</span>dataset1, <span style="color: #689f38;">1</span><span style="color: #1565C0;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; [False, True, True, False]
[True, True, True, False]
</pre>

</section>
<section id="slide-orgheadline24">
<h3 id="orgheadline24">Documentation</h3>
<p>
There are several ways to document code in Python. 
</p>

<p>
Scientists often use the <a href="https://github.com/numpy/numpy/blob/master/doc/HOWTO_DOCUMENT.rst.txt">numpy Documentation style.</a>
</p>

<p>
There is also <a href="https://www.python.org/dev/peps/pep-0257/">PEP 257 Python Docstring Standard</a>
</p>

<p class="fragment grow highlight-red">
Be Consistent
</p>

</section>
<section id="slide-orgheadline25">
<h3 id="orgheadline25"></h3>
<p>
Documentation is useful for autocompletion in IDE
</p>

<p>
Generation of HTML or PDF Documentation using <a href="http://sphinx-doc.org/">Sphinx</a>.
</p>

</section>
<section id="slide-orgheadline26">
<h3 id="orgheadline26">Functions with keyword arguments</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #00796b;">def</span> <span style="color: #0097A7;">classifydefault</span><span style="color: #e91e63;">(</span>dataset, threshold=<span style="color: #689f38;">2</span>.<span style="color: #689f38;">5</span><span style="color: #e91e63;">)</span>:
    <span style="color: #689f38;">"""</span>
<span style="color: #689f38;">    classifies dataset into small and large class using the </span>
<span style="color: #689f38;">    threshold</span>

<span style="color: #689f38;">    Parameters</span>
<span style="color: #689f38;">    ----------</span>
<span style="color: #689f38;">    dataset: list</span>
<span style="color: #689f38;">        list to classify</span>
<span style="color: #689f38;">    threshold: float, optional</span>
<span style="color: #689f38;">        threshold to use for classification</span>

<span style="color: #689f38;">    Returns</span>
<span style="color: #689f38;">    -------</span>
<span style="color: #689f38;">    results: list</span>
<span style="color: #689f38;">        containing True or False</span>
<span style="color: #689f38;">    """</span>
    <span style="color: #EF6C00;">results</span> = <span style="color: #e91e63;">[]</span>  <span style="color: #607d8b;"># </span><span style="color: #607d8b;">create an empty list</span>
    <span style="color: #00796b;">for</span> data <span style="color: #00796b;">in</span> dataset:
        results.append<span style="color: #e91e63;">(</span>data &gt; threshold<span style="color: #e91e63;">)</span>
    <span style="color: #00796b;">return</span> results
</pre>
</div>

</section>
<section id="slide-orgheadline27">
<h3 id="orgheadline27"></h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #EF6C00;">dataset2</span> = <span style="color: #e91e63;">[</span><span style="color: #689f38;">1</span>.<span style="color: #689f38;">73</span>, <span style="color: #689f38;">80</span>, <span style="color: #689f38;">2</span>.<span style="color: #689f38;">4122</span>, -<span style="color: #689f38;">4</span>, <span style="color: #689f38;">2</span>.<span style="color: #689f38;">6</span><span style="color: #e91e63;">]</span>
<span style="color: #00796b;">print</span><span style="color: #e91e63;">(</span>classifydefault<span style="color: #1565C0;">(</span>dataset2<span style="color: #1565C0;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<pre class="example">
[False, True, False, False, True]
</pre>

</section>
