02-Control Structures and Debugging/slides.org
** Namespaces
Functions/Classes and Packages/Modules define their own local namespace.
#+begin_src python :results output pp :exports both :tangle lecture2.py
variable = "I am Global"
var = "I'm also Global"
def func():
    variable = "I am Local"
    print(variable)
    print(var)

print(variable)
func()
#+end_src

#+RESULTS:
: I am Global
: I am Local
: I'm also Global

** Functions and mutable types
Careful when changing a list in a function
#+begin_src python :results output pp :exports both :tangle lecture2.py
l = [1, 2, 3]
def func(ls):
    ls.append(4)

print(l)
func(l)
print(l)
#+end_src

#+RESULTS:
: [1, 2, 3]
: [1, 2, 3, 4]

** Mini Exercise
#+begin_src python :results output pp :exports both :tangle lecture2.py
####################################################################
# Mini Exercise 

# Write a function that classifies strings by length
# inputs should be a list of strings, and a threshold 
# specifying the number of characters
# The output should be a list containing the strings "shorter" or "longer"
# lets ignore strings of length = threshold for now
print(len("test")) # hint
# list of random strings
test_strings = ["faucal" ,"fiddling" ,"instil" ,"blake" ,"profanely" ,
                "bootblack" ,"decongest" ,"interest" ,"arrowy" ,"eponymic"]
####################################################################
#+end_src

* String Formatting

#+begin_src python :results output pp :exports both :tangle lecture2.py
# String Formatting
# handy for any kind of logging, etc.
# mark replacement fields with curly braces
arg = 'world'
res = "hello {}".format(arg)
print(res)
#+end_src

#+begin_src python :results output pp :exports both :tangle lecture2.py
res = "{} and {}".format("a pear", "a tree")
print(res)
#+end_src

** 
#+begin_src python :results output pp :exports both :tangle lecture2.py
# refer to arguments by index; possibly re-use them
res = "{0} and {1}, {1} and {0}".format("a pear", "a tree")
print(res)

# refer to arguments by name; possibly re-use them
res = "{good} is better than {bad}".format(good="some", bad="nothing")
print(res)
#+end_src

** 
#+begin_src python :results output pp :exports both :tangle lecture2.py
# practically anything can be an argument to format(.)
value = 3.429188
res = "value is: {}".format(value)
print(res)

# custom formatting using format specifiers:
# format specifiers follow a colon inside the curly braces
# format as fixed point, with 3 digits after comma
res = "value is: {:.3f}".format(value)
print(res)
#+end_src

** 
#+begin_src python :results output pp :exports both :tangle lecture2.py
# format left-aligned, centered, and right-aligned 
# with the given minimum width,
# and a trailing line-break
# prepare the template-string
tpl = "{:<15} {:^5} {:>10}\n"
# provide empty string to match all replacement fields
res = tpl.format("Carl Friedrich", "", "Gauss")
# re-use the template-string
res += tpl.format("Alexander", "von",  "Humboldt")
res += tpl.format("Gerhard", "", "Mercator")
print(res)
#+end_src

** 
#+begin_src python :results output pp :exports both :tangle lecture2.py
# multi-line strings can be formatted just as well.
res = """# This might be a {}-file-header,
# created by {}
# on {}""".format("text", "me", "2014-02-18")
print(res)
#+end_src

Complete Format Specification Mini-Language:
http://docs.python.org/2/library/string.html#formatspec


